---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.Dispose
source: html/ebbd79fd-488e-d19c-a8ff-ce96e35e9b30.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.Dispose Method

Releases all resources used by the ElectricalDemandFactorValue

## Syntax (C#)
```csharp
public void Dispose()
```